#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

==>environment: prod, workspace: cicd<==
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.submodule_cicd[0].module.network.tencentcloud_subnet.subnet will be created
  + resource "tencentcloud_subnet" "subnet" {
      + availability_zone  = "ap-guangzhou-3"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.4.0.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = true
      + name               = "simple-subnet-dev"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # module.submodule_cicd[0].module.network.tencentcloud_vpc.vpc will be created
  + resource "tencentcloud_vpc" "vpc" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.4.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = true
      + name                   = "simple-vpc-dev"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

==>environment: prod, workspace: qta<==
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.submodule_qta[0].module.network.tencentcloud_subnet.subnet will be created
  + resource "tencentcloud_subnet" "subnet" {
      + availability_zone  = "ap-guangzhou-3"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.0.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = true
      + name               = "simple-subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # module.submodule_qta[0].module.network.tencentcloud_vpc.vpc will be created
  + resource "tencentcloud_vpc" "vpc" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = true
      + name                   = "simple-vpc"
    }

  # module.submodule_qta[0].module.security_group.tencentcloud_security_group.sg will be created
  + resource "tencentcloud_security_group" "sg" {
      + id         = (known after apply)
      + name       = "simple-security-group"
      + project_id = (known after apply)
    }

  # module.submodule_qta[0].module.security_group.tencentcloud_security_group_lite_rule.sg_rules will be created
  + resource "tencentcloud_security_group_lite_rule" "sg_rules" {
      + egress            = [
          + "ACCEPT#0.0.0.0/0#ALL#ALL",
        ]
      + id                = (known after apply)
      + ingress           = [
          + "ACCEPT#10.0.0.0/16#ALL#ALL",
          + "ACCEPT#172.16.0.0/22#ALL#ALL",
        ]
      + security_group_id = (known after apply)
    }

  # module.submodule_qta[0].module.tencentcloud_tke.random_password.worker_pwd will be created
  + resource "random_password" "worker_pwd" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 1
      + min_upper        = 1
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.submodule_qta[0].module.tencentcloud_tke.tencentcloud_kubernetes_cluster.cluster will be created
  + resource "tencentcloud_kubernetes_cluster" "cluster" {
      + certification_authority          = (known after apply)
      + claim_expired_seconds            = 300
      + cluster_as_enabled               = false
      + cluster_cidr                     = "172.16.0.0/22"
      + cluster_deploy_type              = "MANAGED_CLUSTER"
      + cluster_external_endpoint        = (known after apply)
      + cluster_internet                 = true
      + cluster_internet_security_group  = (known after apply)
      + cluster_intranet                 = true
      + cluster_intranet_subnet_id       = (known after apply)
      + cluster_ipvs                     = true
      + cluster_level                    = (known after apply)
      + cluster_max_pod_num              = 256
      + cluster_max_service_num          = 256
      + cluster_name                     = "example-cluster"
      + cluster_node_num                 = (known after apply)
      + cluster_os                       = "tlinux2.2(tkernel3)x86_64"
      + cluster_os_type                  = "GENERAL"
      + cluster_version                  = "1.22.5"
      + container_runtime                = "docker"
      + deletion_protection              = false
      + domain                           = (known after apply)
      + enable_customized_pod_cidr       = false
      + id                               = (known after apply)
      + ignore_cluster_cidr_conflict     = false
      + is_non_static_ip_mode            = false
      + kube_config                      = (known after apply)
      + kube_config_intranet             = (known after apply)
      + network_type                     = "GR"
      + node_name_type                   = "lan-ip"
      + password                         = (known after apply)
      + pgw_endpoint                     = (known after apply)
      + security_policy                  = (known after apply)
      + upgrade_instances_follow_cluster = false
      + user_name                        = (known after apply)
      + vpc_id                           = (known after apply)
      + worker_instances_list            = (known after apply)

      + node_pool_global_config {
          + expander                       = (known after apply)
          + ignore_daemon_sets_utilization = (known after apply)
          + is_scale_in_enabled            = (known after apply)
          + max_concurrent_scale_in        = (known after apply)
          + scale_in_delay                 = (known after apply)
          + scale_in_unneeded_time         = (known after apply)
          + scale_in_utilization_threshold = (known after apply)
          + skip_nodes_with_local_storage  = (known after apply)
          + skip_nodes_with_system_pods    = (known after apply)
        }

      + worker_config {
          + availability_zone                       = "ap-guangzhou-3"
          + count                                   = 1
          + desired_pod_num                         = 0
          + enhanced_monitor_service                = true
          + enhanced_security_service               = true
          + instance_charge_type                    = "POSTPAID_BY_HOUR"
          + instance_charge_type_prepaid_period     = 1
          + instance_charge_type_prepaid_renew_flag = "NOTIFY_AND_MANUAL_RENEW"
          + instance_name                           = "sub machine of tke"
          + instance_type                           = "S5.MEDIUM2"
          + internet_charge_type                    = "TRAFFIC_POSTPAID_BY_HOUR"
          + internet_max_bandwidth_out              = 0
          + password                                = (sensitive value)
          + security_group_ids                      = (known after apply)
          + subnet_id                               = (known after apply)
          + system_disk_size                        = 50
          + system_disk_type                        = "CLOUD_PREMIUM"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```

</details>

*Pushed by: @tongyiming, Action: `pull_request`*